# from status_monitor.download import download_file
# download_file()
import random
for i in range(5):
    upname = ''
    name_space = {'name_space0': ['嗨！', '嘻嘻.', '嘻嘻嘻...', '嘿嘿~', '哇塞！'], 
                    'name_space1': ['你喜欢的', '兄弟们来看', '这就是你想要的', '今日份', '别眨眼，', '艾特你的列表来看', '快看！', '今日限定！', '喜欢', '选一个'],
                    'name_space2': ['天生丽质', '亭亭玉立', '袅娜娉婷', '国色天香', '可爱', '漂亮', '正点聪慧', '醒目', '善良', '机灵', '有气质', '清秀', '清纯', '美艳', '有魅力', '绝代佳人', '仙姿佚貌', '冰肌玉骨', '眉目如画', '环肥燕瘦',
                                    '眉清目秀', '千娇百媚', '梨花带雨', '宛转蛾眉', '靡颜腻理', '粉妆玉琢', '月里嫦娥', '国色天姿', '玉貌花容', '秀外惠中', '仙姿玉貌', '美若天仙', '美愈天人', '貌赛西施', '美艳绝世', '清艳脱俗', '妖娆动人', '淡扫峨眉', '螓首蛾眉'],
                    'name_space3': ['の', 'de', '的', '的', '的', '的', '的', '的', '的', '的'], 
                    'name_space4': ['小姐姐', '小姐姐们'], 
                    'name_space5': ['😀', '😃', '😄', '😁', '😆', '😅', '🤣', '😂', '🙂', '😉', '😊', '😇', '🥰', '😍', '🤩', '😘', '😗', '😚', '😙', '😋', '😛', '😜', '🤪', '😝', '🤗', '🤭', '🤫', '🤔', '🤐', '🤨', '😐', '😑', '😶', '😏', '😬', '🤥', '😌', '🤤', '🥴', '🤯', '🤠', '🥳', '🥸', '😎', '🤓', '😮', '😯', '😲', '😳', '🥺'],
                    'name_space6': ['🐵', '🐒', '🦍', '🦧', '🐕', '🦮', '🐕','🦺', '🐩', '🐺', '🦊', '🦝', '🐱', '🐈', '🐈', '🦁', '🐯', '🐅', '🐆', '🦄', '🦓', '🦌', '🦬', '*', '🐂', '🐃', '🐄', '🐷', '🐖', '🐗', '🐽', '🐏', '🐑', '🐐', '🐪', '🐫', '🦙', '🦒', '🐘', '🦣', '🦏', '🦛', '🐭', '🐁', '🐀', '🐹', '🐰', '🐇', '🐿', '🦫', '🦔', '🐨', '🐼', '🦥', '🦦', '🦨', '🦘', '🦡', '🐾', '🦃', '🐔', '🐓', '🐣', '🐤', '🐥', '🐦', '🦅', '🦆', '🦢', '🦉', '🦤', '🪶', '🦩', '🦚', '🦜', '🐸', '🐊', '*', '🦎', '🐍', '🐲', '🐉', '🦕', '🦖', '🐳', '🐋', '🐬', '🦭', '🐟', '🐡', '🦈', '🐙']
                    }
    for i in range(7):
        upname += name_space[f'name_space{i}'][random.randint(0, len(name_space[f'name_space{i}'])-1)]
    print(upname)